evaluation/tfl_performance.txt
tfl

50
Transactions:            629 hits
Availability:         100.00 %
Elapsed time:          59.79 secs
Data transferred:         2.23 MB
Response time:            4.13 secs
Transaction rate:        10.52 trans/sec
Throughput:           0.04 MB/sec
Concurrency:           43.43
Successful transactions:         629
Failed transactions:             0
Longest transaction:         10.17
Shortest transaction:         0.46

100
Transactions:           1328 hits
Availability:         100.00 %
Elapsed time:          59.90 secs
Data transferred:         4.60 MB
Response time:            3.92 secs
Transaction rate:        22.17 trans/sec
Throughput:           0.08 MB/sec
Concurrency:           86.86
Successful transactions:        1328
Failed transactions:             0
Longest transaction:         10.47
Shortest transaction:         0.12

150
Transactions:           1695 hits
Availability:         100.00 %
Elapsed time:          59.23 secs
Data transferred:         5.65 MB
Response time:            4.62 secs
Transaction rate:        28.62 trans/sec
Throughput:           0.10 MB/sec
Concurrency:          132.23
Successful transactions:        1695
Failed transactions:             0
Longest transaction:         19.29
Shortest transaction:         0.09


200
Transactions:           1822 hits
Availability:          98.22 %
Elapsed time:          59.58 secs
Data transferred:         5.91 MB
Response time:            4.97 secs
Transaction rate:        30.58 trans/sec
Throughput:           0.10 MB/sec
Concurrency:          151.94
Successful transactions:        1822
Failed transactions:            33
Longest transaction:         27.87
Shortest transaction:         0.11

250
Transactions:           2285 hits
Availability:          97.77 %
Elapsed time:          59.63 secs
Data transferred:         7.70 MB
Response time:            4.67 secs
Transaction rate:        38.32 trans/sec
Throughput:           0.13 MB/sec
Concurrency:          179.10
Successful transactions:        2285
Failed transactions:            52
Longest transaction:         23.12
Shortest transaction:         0.10

Lifting the server siege...      done.

Transactions:           1150 hits
Availability:          92.52 %
Elapsed time:          59.70 secs
Data transferred:         3.89 MB
Response time:            7.75 secs
Transaction rate:        19.26 trans/sec
Throughput:           0.07 MB/sec
Concurrency:          149.19
Successful transactions:        1150
Failed transactions:            93
Longest transaction:         26.42
Shortest transaction:         0.07

FILE: /usr/local/var/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.

Lifting the server siege...      done.

Transactions:           1035 hits
Availability:          94.09 %
Elapsed time:          59.21 secs
Data transferred:         3.57 MB
Response time:            7.52 secs
Transaction rate:        17.48 trans/sec
Throughput:           0.06 MB/sec
Concurrency:          131.40
Successful transactions:        1035
Failed transactions:            65
Longest transaction:         28.88
Shortest transaction:         0.11

300
Transactions:           1864 hits
Availability:          94.72 %
Elapsed time:          59.21 secs
Data transferred:         6.05 MB
Response time:            6.38 secs
Transaction rate:        31.48 trans/sec
Throughput:           0.10 MB/sec
Concurrency:          200.79
Successful transactions:        1864
Failed transactions:           104
Longest transaction:         29.33
Shortest transaction:         0.08

350
Transactions:           2277 hits
Availability:          94.91 %
Elapsed time:          59.44 secs
Data transferred:         7.86 MB
Response time:            5.75 secs
Transaction rate:        38.31 trans/sec
Throughput:           0.13 MB/sec
Concurrency:          220.21
Successful transactions:        2277
Failed transactions:           122
Longest transaction:         27.26
Shortest transaction:         0.65

400
Transactions:           1823 hits
Availability:          91.24 %
Elapsed time:          59.04 secs
Data transferred:         6.20 MB
Response time:            6.22 secs
Transaction rate:        30.88 trans/sec
Throughput:           0.10 MB/sec
Concurrency:          192.04
Successful transactions:        1823
Failed transactions:           175
Longest transaction:         28.86
Shortest transaction:         0.05

450
Transactions:           1463 hits
Availability:          83.36 %
Elapsed time:          59.57 secs
Data transferred:         4.88 MB
Response time:            7.59 secs
Transaction rate:        24.56 trans/sec
Throughput:           0.08 MB/sec
Concurrency:          186.32
Successful transactions:        1463
Failed transactions:           292
Longest transaction:         31.30
Shortest transaction:         0.06

500
Transactions:            405 hits
Availability:          50.31 %
Elapsed time:          59.16 secs
Data transferred:         1.31 MB
Response time:           17.68 secs
Transaction rate:         6.85 trans/sec
Throughput:           0.02 MB/sec
Concurrency:          121.00
Successful transactions:         405
Failed transactions:           400
Longest transaction:         31.23
Shortest transaction:         0.00

FILE: /usr/local/var/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.


2015-06-04 11:56:59,     44,      59.99,           0,      15.69,        0.73,        0.00,       11.51,      44,      45
2015-06-04 12:00:14,    106,      59.11,           0,      19.15,        1.79,        0.00,       34.34,     106,       0
2015-06-04 12:02:23,     41,      59.69,           0,      12.86,        0.69,        0.00,        8.83,      41,     148
2015-06-04 12:03:41,      6,      49.79,           0,      28.98,        0.12,        0.00,        3.49,       6,     144
2015-06-04 12:04:42,      3,      50.25,           0,      28.76,        0.06,        0.00,        1.72,       3,      47
2015-06-04 12:06:29,     65,      59.64,           0,      16.41,        1.09,        0.00,       17.89,      65,     198
2015-06-04 12:07:32,      5,      46.43,           0,      27.99,        0.11,        0.00,        3.01,       5,      75
2015-06-04 12:08:53,    104,      59.61,           0,      21.40,        1.74,        0.00,       37.34,     104,       6
2015-06-04 12:10:37,    250,      59.31,           0,      10.74,        4.22,        0.00,       45.25,     250,       0
2015-06-04 12:46:45,     16,      59.35,           0,      14.54,        0.27,        0.00,        3.92,      16,     100
2015-06-04 12:48:02,    436,      59.07,           1,      12.20,        7.38,        0.02,       90.03,     436,       0
2015-06-04 12:53:05,    629,      59.79,           2,       4.13,       10.52,        0.03,       43.43,     629,       0
2015-06-04 12:54:23,   1328,      59.90,           4,       3.92,       22.17,        0.07,       86.86,    1328,       0
2015-06-04 12:55:34,   1695,      59.23,           5,       4.62,       28.62,        0.08,      132.23,    1695,       0
2015-06-04 12:57:54,   1822,      59.58,           5,       4.97,       30.58,        0.08,      151.94,    1822,      33
2015-06-04 12:58:19,    480,      18.62,           1,       5.83,       25.78,        0.05,      150.26,     480,    1216
2015-06-04 13:00:02,   2285,      59.63,           7,       4.67,       38.32,        0.12,      179.10,    2285,      52
2015-06-04 13:02:37,   1150,      59.70,           3,       7.75,       19.26,        0.05,      149.19,    1150,      93
2015-06-04 13:03:45,   1035,      59.21,           3,       7.52,       17.48,        0.05,      131.40,    1035,      65
2015-06-04 13:05:09,   1864,      59.21,           6,       6.38,       31.48,        0.10,      200.79,    1864,     104
2015-06-04 13:08:47,   2277,      59.44,           7,       5.75,       38.31,        0.12,      220.21,    2277,     122
2015-06-04 13:11:04,   1823,      59.04,           6,       6.22,       30.88,        0.10,      192.04,    1823,     175
2015-06-04 13:12:46,   1463,      59.57,           4,       7.59,       24.56,        0.07,      186.32,    1463,     292
2015-06-04 13:14:08,    405,      59.16,           1,      17.68,        6.85,        0.02,      121.00,     405,     400